app/controllers/api/areas_controller.rb

SELECT "areas".* FROM "areas" ORDER BY "areas"."name" ASC
SELECT "vidhansabhas".* FROM "vidhansabhas" WHERE "vidhansabhas"."id" IN (1, 2)
SELECT "village_wards".* FROM "village_wards" WHERE "village_wards"."area_id" IN (3, 2, 1)
---
    def index
      areas = Area.includes(:vidhansabha, :village_wards).order(:name)