app/controllers/api/auth_controller.rb

    def admin_login
      user = User.find_by(mobile_number: params.require(:mobile_number))
---
SELECT "users".* FROM "users" WHERE "users"."mobile_number" = '9999999999' LIMIT 1