app/controllers/api/campaigns_controller.rb

    def index
      render json: Campaign.order(created_at: :desc).map { |c| serialize(c) }
---
SELECT "campaigns".* FROM "campaigns" ORDER BY "campaigns"."created_at" DESC

    def create
      record = Campaign.new(campaign_params)
      record.uploaded_image.attach(params[:uploaded_image]) if params[:uploaded_image].present?
      record.save ? render(json: serialize(record), status: :created) : render_model_errors(record)
---
INSERT INTO "campaigns" ("title", "description", "language", "target_area", "target_village", "target_support_status", "scheduled_at", "campaign_status", "created_at", "updated_at") VALUES ('indore ksethre bhraman', 'indore', 'hindi', 'Indore', 'Indore', 0, '2026-05-27 00:00:00', 2, '2026-05-27 08:49:06.210210', '2026-05-27 08:49:06.210210') RETURNING "id"
INSERT INTO "campaigns" ("title", "description", "language", "target_area", "target_village", "target_support_status", "scheduled_at", "campaign_status", "created_at", "updated_at", "image_url") VALUES ('Indore mein CM ki raily', 'Indore mein CM ki raily BJP chunaav se  sambandhit', 'Hindi', 'Indore', 'Indore', 0, '2026-06-20 00:00:00', 2, '2026-05-27 11:27:47.277283', '2026-05-27 11:27:47.277283', NULL) RETURNING "id"