app/controllers/api/otp_controller.rb

SELECT "mobile_otp_verifications".* FROM "mobile_otp_verifications" WHERE "mobile_otp_verifications"."phone_number" = '9090909090' AND "mobile_otp_verifications"."purpose" = 'login' AND "mobile_otp_verifications"."verified_at" IS NOT NULL ORDER BY "mobile_otp_verifications"."created_at" DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."mobile_number" = '9090909090' LIMIT 1
---
    def register
      phone = params.require(:phone_number)
      name = params.require(:name)

      unless phone.match?(/\A\d{10}\z/)
        return render json: { error: "मोबाइल नंबर 10 अंकों का होना चाहिए" }, status: :unprocessable_entity
      end

      otp_record = MobileOtpVerification.where(phone_number: phone, purpose: "registration")
                                         .where.not(verified_at: nil)
                                         .order(created_at: :desc)
                                         .first

      unless otp_record
        return render json: { error: "पहले OTP सत्यापित करें" }, status: :unprocessable_entity
      end

      unless otp_record.verifiable_type.nil?
        return render json: { error: "इस मोबाइल नंबर से पहले ही पंजीकरण हो चुका है" }, status: :unprocessable_entity
      end

      user = User.find_or_initialize_by(mobile_number: phone)

INSERT INTO "users" ("name", "mobile_number", "role", "password_digest", "otp_code", "otp_requested_at", "created_at", "updated_at", "phone_number", "address", "village_or_ward", "area", "rural_or_urban", "preferred_language") VALUES ('Rajesh sharma', '9090909090', 11, NULL, NULL, NULL, '2026-05-27 11:26:15.211125', '2026-05-27 11:26:15.211125', NULL, NULL, 'indore', 'indore', 0, 'hi') RETURNING "id"
---
        role: :public_user
      )

      if user.save