app/controllers/api/otp_controller.rb

    def verify_otp
      phone = params.require(:phone_number)
      otp = params.require(:otp)
      purpose = params[:purpose] || 'login'

      unless otp.match?(/\A\d{6}\z/)
        return render json: { error: "OTP 6 अंकों का होना चाहिए" }, status: :unprocessable_entity
      end

      result = Otp::VerifyService.call(phone_number: phone, otp: otp, purpose: purpose)

      if result[:success]
        user = User.find_by(mobile_number: phone)
---
SELECT "users".* FROM "users" WHERE "users"."mobile_number" = '9999999999' LIMIT 1