app/controllers/api/permissions_controller.rb

SELECT "permissions".* FROM "permissions" ORDER BY "permissions"."key" ASC
---
    def index
      render json: Permission.order(:key)