app/controllers/api/population_records_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" IN (3, 2, 1, 8, 7)
SELECT "population_records".* FROM "population_records" WHERE (LOWER(area) LIKE '%g%') AND "population_records"."gender" = 2 ORDER BY "population_records"."created_at" DESC
SELECT "village_wards".* FROM "village_wards" WHERE "village_wards"."id" IN (41, 37, 35, 29, 24, 40, 36, 34, 33, 45, 44, 42, 32, 38)
---
    def index
      records = PopulationRecord.includes(:vidhansabha, :area_ref, :village_ward)
        .by_vidhansabha(params[:vidhansabha])
        .by_area(params[:area])
        .by_village_or_ward(params[:village_or_ward])
        .by_rural_or_urban(params[:rural_or_urban])
        .by_age(params[:age])
        .by_gender(params[:gender])
        .by_phone_number(params[:phone_number])
        .order(created_at: :desc)

INSERT INTO "population_records" ("name", "age", "gender", "phone_number", "address", "area", "village_or_ward", "rural_or_urban", "family_count", "aadhaar_image_url", "whatsapp_consent", "notes", "tags", "vidhansabha_id", "area_ref_id", "village_ward_id", "created_at", "updated_at", "full_name", "village", "ward", "booth_number", "voter_id", "aadhaar_document_url", "political_support_status", "assigned_worker", "political_engagement") VALUES ('ram narayan', NULL, 0, '9090909090', NULL, 'INdore', NULL, 0, 1, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, '2026-05-26 13:33:34.557889', '2026-05-26 13:33:34.557889', NULL, 'ramwasa', '40', NULL, NULL, NULL, 0, NULL, NULL) RETURNING "id"
---
    def create
      record = PopulationRecord.new(population_record_params)

      if record.save