app/controllers/api/pr_posts_controller.rb

    def index
      render json: PrPost.order(created_at: :desc).map { |p| serialize(p) }
---
SELECT "pr_posts".* FROM "pr_posts" ORDER BY "pr_posts"."created_at" DESC