app/controllers/api/public_users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."mobile_number" = '7777777777' LIMIT 1
---
    def request_otp
      user = User.find_or_initialize_by(mobile_number: params.require(:mobile_number))

SELECT "users".* FROM "users" WHERE "users"."role" = 11 AND "users"."mobile_number" = '7777777777' AND "users"."otp_code" = '123456' LIMIT 1
---
    def verify_otp
      user = User.public_user.find_by(mobile_number: params.require(:mobile_number), otp_code: params.require(:otp_code))