app/controllers/api/public_requests_controller.rb

    def index
      records = current_user.public_user? ? current_user.submitted_requests : PublicRequest.all
      records = records.where(status: PublicRequest.statuses[params[:status]]) if params[:status].present? && PublicRequest.statuses.key?(params[:status])
      render json: records.order(created_at: :desc).as_json(include: [:request_comments, :request_histories])
---
SELECT "public_requests".* FROM "public_requests" ORDER BY "public_requests"."created_at" DESC

    def create
      load_optional_current_user
      record = PublicRequest.new(public_request_params)
      record.public_user ||= current_user if defined?(current_user) && current_user&.public_user?
      record.attachment.attach(params[:attachment]) if params[:attachment].present?

      if record.save
---
INSERT INTO "public_requests" ("name", "phone_number", "area", "village_or_ward", "category", "description", "image_url", "severity", "status", "created_at", "updated_at", "request_title", "public_user_id", "assigned_to", "document_url") VALUES ('Test Public', '7777777777', 'Mehgaon', 'Ward 1', 'hospital', 'hospital emergency', NULL, 3, 0, '2026-05-26 10:51:52.615657', '2026-05-26 10:51:52.615657', 'Emergency hospital help', 3, NULL, NULL) RETURNING "id"

    def update
      old_status = @public_request.status
      if @public_request.update(public_request_params)
---
UPDATE "public_requests" SET "status" = 2, "updated_at" = '2026-05-26 11:08:41.014760' WHERE "public_requests"."id" = 4

    def set_public_request
      @public_request = PublicRequest.find(params[:id])
---
SELECT "public_requests".* FROM "public_requests" WHERE "public_requests"."id" = 4 LIMIT 1

    def load_optional_current_user
      token = request.authorization.to_s[/\ABearer (.+)\z/, 1]
      return if token.blank?

      payload = jwt_decode(token)
      @current_user = User.find_by(id: payload[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

    def create_history(request, old_status)
      request.request_histories.create!(
        user: current_user,
        from_status: old_status,
        to_status: request.status,
        note: "Status updated"
      )
---
INSERT INTO "request_histories" ("public_request_id", "user_id", "from_status", "to_status", "note", "created_at", "updated_at") VALUES (4, 1, 'new_request', 'in_progress', 'Status updated', '2026-05-26 11:08:41.048983', '2026-05-26 11:08:41.048983') RETURNING "id"