app/controllers/api/role_permissions_controller.rb

SELECT "role_permissions".* FROM "role_permissions" ORDER BY "role_permissions"."role" ASC, "role_permissions"."permission_id" ASC
---
    def index
      render json: RolePermission.includes(:permission).order(:role, :permission_id).as_json(include: :permission)

INSERT INTO "role_permissions" ("role", "permission_id", "created_at", "updated_at") VALUES (10, 7, '2026-05-27 11:19:39.519007', '2026-05-27 11:19:39.519007') RETURNING "id"
---
    def create
      record = RolePermission.new(role_permission_params)
      record.save ? render(json: record.as_json(include: :permission), status: :created) : render_model_errors(record)

SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = 7 LIMIT 1
---
    def destroy
      record = RolePermission.find(params[:id])