app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."role" ASC, "users"."name" ASC
---
    def index
      render json: User.order(:role, :name).as_json(only: %i[id name mobile_number role area village_or_ward])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])