app/controllers/api/work_dones_controller.rb

    def index
      records = WorkDone.includes(:population_record).order(created_at: :desc)
      records = records.where(population_record_id: params[:population_record_id]) if params[:population_record_id].present?
      render json: records.map { |w| serialize(w) }
---
SELECT "population_records".* FROM "population_records" WHERE "population_records"."id" IN (8, 7, 6, 5, 4, 3, 2)
SELECT "work_dones".* FROM "work_dones" ORDER BY "work_dones"."created_at" DESC