app/controllers/api/public/campaign_supports_controller.rb

  def create
    phone = params.require(:campaign_support).require(:phone_number)

    otp_record = MobileOtpVerification.where(phone_number: phone, purpose: "campaign_support")
                                       .where.not(verified_at: nil)
                                       .order(created_at: :desc)
                                       .first

    unless otp_record
      return render json: { error: "पहले OTP सत्यापित करें" }, status: :unprocessable_entity
    end

    support = CampaignSupport.new(support_params)
    if support.save
---
INSERT INTO "campaign_supports" ("campaign_id", "name", "phone_number", "area", "village_or_ward", "message", "created_at", "updated_at") VALUES (2, 'water water', '1111111111', 'water', 'water', 'water', '2026-05-27 10:32:53.240034', '2026-05-27 10:32:53.240034') RETURNING "id"