app/controllers/api/public/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."campaign_status" IN (1, 2, 3) ORDER BY COALESCE(scheduled_at, created_at) DESC
---
      def index
        campaigns = Campaign.where(campaign_status: [:scheduled, :active, :completed])
                            .order(Arel.sql("COALESCE(scheduled_at, created_at) DESC"))
        render json: campaigns.map { |c| serialize(c) }

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = 3 LIMIT 1
---
      def show
        campaign = Campaign.find(params[:id])