app/controllers/api/public/home_controller.rb

      def index
        pr_posts = PrPost.where(status: :published).order(published_at: :desc, created_at: :desc).limit(6)
        campaigns = Campaign.where(campaign_status: [:scheduled, :active, :completed]).order(Arel.sql("COALESCE(scheduled_at, created_at) DESC")).limit(6)
        work_dones = WorkDone.where(status: :completed).order(Arel.sql("COALESCE(completed_at, created_at) DESC")).limit(6)

        render json: {
          latest_updates: build_updates(pr_posts, campaigns, work_dones),
          pr_posts: pr_posts.map { |p| serialize_pr_post(p) },
          campaigns: campaigns.map { |c| serialize_campaign(c) },
          work_dones: work_dones.map { |w| serialize_work_done(w) },
          stats: {
            completed_work_count: WorkDone.where(status: :completed).count,
            active_campaign_count: Campaign.where(campaign_status: :active).count,
            resolved_request_count: PublicRequest.where(status: :resolved).count,
            published_pr_count: PrPost.where(status: :published).count
---
SELECT "pr_posts".* FROM "pr_posts" WHERE "pr_posts"."status" = 2 ORDER BY "pr_posts"."published_at" DESC, "pr_posts"."created_at" DESC LIMIT 6
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."campaign_status" IN (1, 2, 3) ORDER BY COALESCE(scheduled_at, created_at) DESC LIMIT 6
SELECT "work_dones".* FROM "work_dones" WHERE "work_dones"."status" = 2 ORDER BY COALESCE(completed_at, created_at) DESC LIMIT 6
SELECT COUNT(*) FROM "campaigns" WHERE "campaigns"."campaign_status" = 2