app/controllers/api/public/pr_posts_controller.rb

SELECT "pr_posts".* FROM "pr_posts" WHERE "pr_posts"."status" = 2 ORDER BY "pr_posts"."published_at" DESC, "pr_posts"."created_at" DESC
---
      def index
        posts = PrPost.where(status: :published).order(published_at: :desc, created_at: :desc)
        render json: posts.map { |p| serialize(p) }

SELECT "pr_posts".* FROM "pr_posts" WHERE "pr_posts"."status" = 2 AND "pr_posts"."id" = 3 LIMIT 1
---
      def show
        post = PrPost.where(status: :published).find(params[:id])