app/controllers/api/public/profile_controller.rb

SELECT "profiles".* FROM "profiles" ORDER BY "profiles"."id" ASC LIMIT 1
---
      def show
        profile = Profile.first