app/controllers/api/public/requests_controller.rb

      def create
        request_record = PublicRequest.new(public_request_params)

        if request_record.save
---
INSERT INTO "public_requests" ("name", "phone_number", "area", "village_or_ward", "category", "description", "image_url", "severity", "status", "created_at", "updated_at", "request_title", "public_user_id", "assigned_to", "document_url", "internal_notes", "public_response", "expected_resolution_date", "resolution_summary", "escalated", "assigned_to_user_id") VALUES ('asdfas', '9999999999', 'asdfa', 'asdf', 'electricity', 'asdf', '', 2, 0, '2026-05-26 11:47:37.703271', '2026-05-26 11:47:37.703271', 'asdfasd', NULL, NULL, NULL, NULL, NULL, NULL, NULL, FALSE, NULL) RETURNING "id"

      def set_request_for_status
        @request = PublicRequest.find(params[:id])
---
SELECT "public_requests".* FROM "public_requests" WHERE "public_requests"."id" = 5 LIMIT 1