app/controllers/api/admin/requests_controller.rb

SELECT "public_requests".* FROM "public_requests" WHERE "public_requests"."id" = 4 LIMIT 1
---
      def set_request
        @request = PublicRequest.find(params[:id])

INSERT INTO "request_activities" ("public_request_id", "user_id", "action", "old_value", "new_value", "notes", "created_at", "updated_at") VALUES (4, 1, 'status_changed', 'in_progress', 'in_progress', 'testing', '2026-05-26 11:15:31.733494', '2026-05-26 11:15:31.733494') RETURNING "id"
---
      def activity(request_record, action, old_value, new_value, notes)
        request_record.request_activities.create!(
          user: current_user,
          action: action,
          old_value: old_value,
          new_value: new_value,
          notes: notes
        )