app/services/otp/generate_service.rb

INSERT INTO "mobile_otp_verifications" ("phone_number", "otp_digest", "expires_at", "verified_at", "attempts_count", "resend_count", "last_sent_at", "purpose", "ip_address", "created_at", "updated_at") VALUES ('9999999999', 'b2fcc5c0be2ec40c36ecd505847f0c1b34bd49f6cb924ac6ad431a3d9691d1a7', '2026-05-27 10:44:15.890194', NULL, 0, 0, '2026-05-27 10:39:15.890302', 'test', NULL, '2026-05-27 10:39:15.898604', '2026-05-27 10:39:15.898604') RETURNING "id"
---
  def self.call(phone_number:, purpose:, ip_address: nil)
    MobileOtpVerification.where(phone_number: phone_number, purpose: purpose)
                         .unverified
                         .update_all(expires_at: Time.current)

    otp = rand(100000..999999).to_s
    digest = Digest::SHA256.hexdigest(otp)

    MobileOtpVerification.create!(
      phone_number: phone_number,
      otp_digest: digest,
      purpose: purpose,
      expires_at: MobileOtpVerification::OTP_EXPIRY.from_now,
      attempts_count: 0,
      resend_count: 0,
      last_sent_at: Time.current,
      ip_address: ip_address
    )