app/services/otp/send_service.rb

  def self.call(phone_number:, purpose:, ip_address: nil)
    if ip_address.present?
      recent_from_ip = MobileOtpVerification.where(ip_address: ip_address)
                                            .where("created_at > ?", IP_COOLDOWN.ago)
                                            .count
      if recent_from_ip >= MAX_IP_REQUESTS
        return { success: false, error: "बहुत अधिक अनुरोध। कृपया बाद में प्रयास करें।" }
      end
    end

    latest = MobileOtpVerification.where(phone_number: phone_number, purpose: purpose)
                                   .where("expires_at > ?", Time.current)
                                   .order(created_at: :desc)
                                   .first
---
SELECT "mobile_otp_verifications".* FROM "mobile_otp_verifications" WHERE "mobile_otp_verifications"."phone_number" = '9999999999' AND "mobile_otp_verifications"."purpose" = 'test' AND (expires_at > '2026-05-27 10:39:15.863692') ORDER BY "mobile_otp_verifications"."created_at" DESC LIMIT 1