app/services/otp/verify_service.rb

  def self.call(phone_number:, otp:, purpose:)
    record = MobileOtpVerification.where(phone_number: phone_number, purpose: purpose)
                                   .valid
                                   .order(created_at: :desc)
                                   .first

    unless record
      return { success: false, error: "कोई वैध OTP नहीं मिला। कृपया पहले OTP भेजें।" }
    end

    if record.attempts_count >= MobileOtpVerification::MAX_ATTEMPTS
      record.update!(expires_at: Time.current)
      return { success: false, error: "बहुत अधिक गलत प्रयास। कृपया पुनः OTP भेजें।" }
    end

    expected_digest = record.otp_digest
    actual_digest = Digest::SHA256.hexdigest(otp)

    if expected_digest != actual_digest
      record.increment!(:attempts_count)
      remaining = MobileOtpVerification::MAX_ATTEMPTS - record.attempts_count
      return { success: false, error: "गलत OTP। #{remaining} प्रयास शेष।" }
    end

    record.update!(verified_at: Time.current, attempts_count: record.attempts_count + 1)
---
SELECT "mobile_otp_verifications".* FROM "mobile_otp_verifications" WHERE "mobile_otp_verifications"."phone_number" = '9340233602' AND "mobile_otp_verifications"."purpose" = 'campaign_support' AND "mobile_otp_verifications"."verified_at" IS NULL AND (expires_at > '2026-05-27 10:40:57.319710') ORDER BY "mobile_otp_verifications"."created_at" DESC LIMIT 1
UPDATE "mobile_otp_verifications" SET "verified_at" = '2026-05-27 10:40:57.336699', "attempts_count" = 1, "updated_at" = '2026-05-27 10:40:57.337819' WHERE "mobile_otp_verifications"."id" = 2