app/controllers/application_controller.rb

  def authenticate_user!
    authenticate_request!
    return if performed?

    @current_user = User.find_by(id: current_jwt_payload[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1