app/models/public_request.rb

  def record_created_activity
    request_activities.create!(action: "created", new_value: status, notes: "Request created")
---
INSERT INTO "request_activities" ("public_request_id", "user_id", "action", "old_value", "new_value", "notes", "created_at", "updated_at") VALUES (15, NULL, 'created', NULL, 'new_request', 'Request created', '2026-05-27 10:47:32.341808', '2026-05-27 10:47:32.341808') RETURNING "id"